---
kind: property
id: P:Autodesk.Revit.DB.ElementType.CanBeCopied
source: html/588e4fac-5492-0e1d-c935-dfd53e801c04.htm
---
# Autodesk.Revit.DB.ElementType.CanBeCopied Property

Determine if this ElementType can create a copy

## Syntax (C#)
```csharp
public bool CanBeCopied { get; }
```